; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	instrument2 - instrument
	satellite2 - satellite
	instrument3 - instrument
	instrument4 - instrument
	spectrograph3 - mode
	thermograph5 - mode
	image4 - mode
	infrared0 - mode
	infrared1 - mode
	spectrograph2 - mode
	GroundStation0 - direction
	Star3 - direction
	Star1 - direction
	Star2 - direction
	Star4 - direction
	Phenomenon5 - direction
	Planet6 - direction
	Star7 - direction
	Planet8 - direction
	Phenomenon9 - direction
	Star10 - direction
	Planet11 - direction
	Star12 - direction
	Phenomenon13 - direction
	Star14 - direction
)
(:init
	(supports instrument0 infrared1)
	(supports instrument0 infrared0)
	(supports instrument0 spectrograph3)
	(calibration_target instrument0 Star2)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Planet6)
	(supports instrument1 spectrograph3)
	(supports instrument1 spectrograph2)
	(calibration_target instrument1 Star3)
	(supports instrument2 image4)
	(supports instrument2 spectrograph2)
	(calibration_target instrument2 Star1)
	(on_board instrument1 satellite1)
	(on_board instrument2 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Phenomenon9)
	(supports instrument3 infrared1)
	(calibration_target instrument3 Star2)
	(supports instrument4 infrared1)
	(supports instrument4 image4)
	(supports instrument4 thermograph5)
	(calibration_target instrument4 Star4)
	(on_board instrument3 satellite2)
	(on_board instrument4 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Planet11)
)
(:goal (and
	(pointing satellite0 Star7)
	(pointing satellite1 Phenomenon9)
	(have_image Phenomenon5 spectrograph3)
	(have_image Planet6 spectrograph3)
	(have_image Planet6 image4)
	(have_image Star7 image4)
	(have_image Planet8 spectrograph3)
	(have_image Phenomenon9 infrared1)
	(have_image Phenomenon9 thermograph5)
	(have_image Star10 spectrograph2)
	(have_image Planet11 spectrograph3)
	(have_image Star12 spectrograph2)
	(have_image Phenomenon13 spectrograph3)
	(have_image Star14 spectrograph3)
	(have_image Star14 infrared1)
))

)

; plan
1. (turn_to satellite2 star4 planet11)
   deleted: (pointing satellite2 planet11)
   added: (pointing satellite2 star4)
   goals met: 1 of 15
2. (switch_on instrument4 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument4)
   goals met: 1 of 15
3. (calibrate satellite2 instrument4 star4)
   added: (calibrated instrument4)
   goals met: 1 of 15
4. (turn_to satellite2 star7 star4)
   deleted: (pointing satellite2 star4)
   added: (pointing satellite2 star7)
   goals met: 1 of 15
5. (take_image satellite2 star7 instrument4 image4)
   added: (have_image star7 image4)
   goals met: 2 of 15
6. (turn_to satellite2 star14 star7)
   deleted: (pointing satellite2 star7)
   added: (pointing satellite2 star14)
   goals met: 2 of 15
7. (take_image satellite2 star14 instrument4 infrared1)
   added: (have_image star14 infrared1)
   goals met: 3 of 15
8. (turn_to satellite2 planet6 star14)
   deleted: (pointing satellite2 star14)
   added: (pointing satellite2 planet6)
   goals met: 3 of 15
9. (take_image satellite2 planet6 instrument4 image4)
   added: (have_image planet6 image4)
   goals met: 4 of 15
10. (turn_to satellite2 phenomenon9 planet6)
   deleted: (pointing satellite2 planet6)
   added: (pointing satellite2 phenomenon9)
   goals met: 4 of 15
11. (turn_to satellite1 star3 phenomenon9)
   deleted: (pointing satellite1 phenomenon9)
   added: (pointing satellite1 star3)
   goals met: 3 of 15
12. (take_image satellite2 phenomenon9 instrument4 thermograph5)
   added: (have_image phenomenon9 thermograph5)
   goals met: 4 of 15
13. (take_image satellite2 phenomenon9 instrument4 infrared1)
   added: (have_image phenomenon9 infrared1)
   goals met: 5 of 15
14. (switch_on instrument1 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument1)
   goals met: 5 of 15
15. (calibrate satellite1 instrument1 star3)
   added: (calibrated instrument1)
   goals met: 5 of 15
16. (turn_to satellite0 star7 planet6)
   deleted: (pointing satellite0 planet6)
   added: (pointing satellite0 star7)
   goals met: 6 of 15
17. (turn_to satellite1 phenomenon13 star3)
   deleted: (pointing satellite1 star3)
   added: (pointing satellite1 phenomenon13)
   goals met: 6 of 15
18. (take_image satellite1 phenomenon13 instrument1 spectrograph3)
   added: (have_image phenomenon13 spectrograph3)
   goals met: 7 of 15
19. (turn_to satellite1 phenomenon5 phenomenon13)
   deleted: (pointing satellite1 phenomenon13)
   added: (pointing satellite1 phenomenon5)
   goals met: 7 of 15
20. (take_image satellite1 phenomenon5 instrument1 spectrograph3)
   added: (have_image phenomenon5 spectrograph3)
   goals met: 8 of 15
21. (turn_to satellite1 planet11 phenomenon5)
   deleted: (pointing satellite1 phenomenon5)
   added: (pointing satellite1 planet11)
   goals met: 8 of 15
22. (take_image satellite1 planet11 instrument1 spectrograph3)
   added: (have_image planet11 spectrograph3)
   goals met: 9 of 15
23. (turn_to satellite1 planet6 planet11)
   deleted: (pointing satellite1 planet11)
   added: (pointing satellite1 planet6)
   goals met: 9 of 15
24. (take_image satellite1 planet6 instrument1 spectrograph3)
   added: (have_image planet6 spectrograph3)
   goals met: 10 of 15
25. (turn_to satellite1 planet8 planet6)
   deleted: (pointing satellite1 planet6)
   added: (pointing satellite1 planet8)
   goals met: 10 of 15
26. (take_image satellite1 planet8 instrument1 spectrograph3)
   added: (have_image planet8 spectrograph3)
   goals met: 11 of 15
27. (turn_to satellite1 star10 planet8)
   deleted: (pointing satellite1 planet8)
   added: (pointing satellite1 star10)
   goals met: 11 of 15
28. (take_image satellite1 star10 instrument1 spectrograph2)
   added: (have_image star10 spectrograph2)
   goals met: 12 of 15
29. (turn_to satellite1 star12 star10)
   deleted: (pointing satellite1 star10)
   added: (pointing satellite1 star12)
   goals met: 12 of 15
30. (take_image satellite1 star12 instrument1 spectrograph2)
   added: (have_image star12 spectrograph2)
   goals met: 13 of 15
31. (turn_to satellite1 star14 star12)
   deleted: (pointing satellite1 star12)
   added: (pointing satellite1 star14)
   goals met: 13 of 15
32. (take_image satellite1 star14 instrument1 spectrograph3)
   added: (have_image star14 spectrograph3)
   goals met: 14 of 15
33. (turn_to satellite1 phenomenon9 star14)
   deleted: (pointing satellite1 star14)
   added: (pointing satellite1 phenomenon9)
   goals met: 15 of 15
